TestCase/swtblis_2ma/0/Fs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Fs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
2.59265e-05
2.45703e-05
2.47001e-05
2.53725e-05
2.34934e-05
2.31835e-05
2.44703e-05
2.43281e-05
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
4.39453e-05
4.38721e-05
4.40092e-05
4.39839e-05
4.39405e-05
4.39157e-05
4.39313e-05
4.40336e-05
...
)
;
    }
    base
    {
        type            calculated;
        value           uniform 4.53979e-05;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53978e-05
4.53976e-05
4.53965e-05
4.53929e-05
4.53846e-05
4.53702e-05
4.53497e-05
4.53229e-05
...
)
;
    }
}


// ************************************************************************* //
