TestCase/swtblis_2ma/0/I1_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I1_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
-1.94438
-2.02868
-2.16889
-2.14141
-2.29539
-2.27383
-2.12309
-2.2938
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-1.9673
-2.04496
-2.1652
-2.14682
-2.0932
-2.08942
-2.18936
-2.37722
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-4.20729e+69
-2.68136e+65
-9.35712e+65
-1.86207e+65
-4.14779e+62
-9.03698e+63
-1.14631e+64
-1.35197e+64
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0
0
0
0
0
0
0
0
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-646.082
-111.717
-52.4135
-28.8082
-20.6427
-17.3715
-16.7118
-17.1669
...
)
;
    }
}


// ************************************************************************* //
