TestCase/swtblis_2ma/0/I2_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.0397002
0.0428906
0.0728325
0.0442562
0.0749383
0.0780192
0.0450803
0.0750023
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.0397002
0.0428906
0.0442562
0.0450803
0.0457125
0.0466938
0.0481624
0.0500609
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2.97391e-09
1.02154e-09
5.5853e-09
6.89596e-09
6.80642e-09
6.49163e-09
6.15272e-09
5.84789e-09
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.6981e-63
4.80386e-61
2.06341e-57
2.72438e-59
1.31552e-61
3.41889e-58
9.75817e-58
4.26539e-57
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.22647e-05
0.000825239
0.0087657
0.0291147
0.0495511
0.0606091
0.0646903
0.0658666
...
)
;
    }
}


// ************************************************************************* //
