TestCase/swtblis_2ma/0/I2_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
-0.00736183
-0.000567571
-0.0185824
-0.000595174
-0.019277
-0.00106049
-0.00884112
-0.00108686
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-0.00736183
-0.000567571
-0.00861617
-0.000619791
-0.00901534
-0.000661565
-0.00972029
-0.000773415
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-1.62177e-13
-5.08117e-21
-4.17416e-13
7.69854e-20
-5.61537e-13
9.69255e-20
-4.82615e-13
6.69722e-20
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-7.26738e-92
3.85371e-90
-1.00673e-85
3.71593e-89
-8.70062e-92
1.02458e-88
-3.06635e-86
1.05414e-87
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-4.29516e-08
-5.7694e-10
-0.00082066
-2.77241e-07
-0.0110293
-1.63856e-06
-0.0164509
-3.84176e-06
...
)
;
    }
}


// ************************************************************************* //
