TestCase/swtblis_2ma/0/I2_3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.0417092
0.0452966
0.073563
0.0463126
0.0757666
0.078639
0.0473372
0.0757146
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.0417092
0.0452966
0.0463126
0.0473372
0.0482356
0.04944
0.0509775
0.0526161
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2.97386e-09
1.02154e-09
5.5853e-09
6.89596e-09
6.80642e-09
6.49163e-09
6.15272e-09
5.84789e-09
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.6981e-63
4.80386e-61
1.9942e-58
2.72438e-59
1.20237e-57
3.41889e-58
9.75817e-58
1.41791e-57
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.22647e-05
0.000825239
0.0087657
0.0291147
0.0495511
0.0606091
0.0646903
0.0658666
...
)
;
    }
}


// ************************************************************************* //
