TestCase/swtblis_2ma/0/I2_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.945154
1.02888
1.17602
1.14641
1.3172
1.29258
1.12687
1.31538
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.967571
1.04546
1.17203
1.15221
1.09537
1.09142
1.19832
1.41279
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
4.42532e+138
1.79742e+130
2.18889e+131
8.66827e+129
4.30104e+124
2.04168e+127
3.28506e+127
4.56959e+127
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0
0
0
0
0
0
0
0
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
104356
3120.19
686.794
207.478
106.53
75.4425
69.8212
73.6754
...
)
;
    }
}


// ************************************************************************* //
