TestCase/swtblis_2ma/0/Mg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Mg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.000920287
0.000944166
0.00281643
0.000932516
0.00286904
0.00324336
0.000919478
0.00284095
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.000920287
0.000944166
0.000932516
0.000919478
0.000904996
0.000894233
0.000887277
0.000880225
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
3.9275e-14
2.99933e-14
4.60604e-14
4.85853e-14
4.84247e-14
4.78476e-14
4.72023e-14
4.65991e-14
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.9658e-18
1.58156e-18
5.87454e-18
2.05309e-18
6.43166e-19
3.71618e-18
4.82199e-18
6.9689e-18
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.62399e-05
0.000288716
0.00152934
0.00511579
0.0113889
0.0179479
0.0226613
0.0256233
...
)
;
    }
}


// ************************************************************************* //
