TestCase/swtblis_2ma/0/Rekd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Rekd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
282.545
278.731
558.063
273.627
563.003
617.339
268.549
563.791
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
282.639
278.823
273.718
268.638
263.665
258.862
254.154
249.456
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2.93694e-21
2.92048e-21
2.92853e-21
2.93403e-21
2.93433e-21
2.93381e-21
2.93323e-21
2.93263e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
461.144
460.944
460.706
460.426
460.095
459.702
459.236
458.687
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.16446
3.7187
8.16954
14.9261
23.4881
31.9201
38.6351
43.6264
...
)
;
    }
}


// ************************************************************************* //
