TestCase/swtblis_2ma/0/Res
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Res;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
1
1
1
1
1
1
1
1
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
8.36887e-20
6.35526e-20
9.78661e-20
1.03425e-19
1.03094e-19
1.01847e-19
1.00454e-19
9.91495e-20
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0121759
0.00946671
0.0298752
0.0105794
0.00351666
0.0187414
0.0242465
0.0349422
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
}


// ************************************************************************* //
