TestCase/swtblis_2ma/0/Rstream
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField::Internal;
    location    "0";
    object      Rstream;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


value           nonuniform List<scalar> 
27324
(
-2.40713e-09
-7.70841e-10
-2.1159e-09
-1.52908e-09
6.39006e-10
9.12745e-10
-8.06619e-10
-2.32578e-11
...
)
;


// ************************************************************************* //
