TestCase/swtblis_2ma/0/Sp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      Sp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<symmTensor> 
27324
(
(-263.892 -8083.06 -1.27714e-08 953.127 1.20554e-09 -689.236)
(-95.2441 -8695.75 -5.06134e-09 854.1 3.86194e-10 -758.856)
(-323.628 -19112.9 -2.49419e-08 1030.57 1.0705e-09 -706.943)
(-207.153 -8978.64 -7.91715e-09 928.131 7.65795e-10 -720.978)
(-166.376 -20168.3 7.47423e-09 934.902 -3.23212e-10 -768.525)
(-386.182 -22252.5 1.07523e-08 1120.13 -4.66367e-10 -733.947)
(-206.171 -9259.38 -5.00586e-09 974.357 4.04157e-10 -768.187)
(-254.404 -20660.8 -1.50612e-09 983.923 1.23919e-11 -729.519)
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
276
(
(-263.892 -8083.06 -1.27714e-08 953.127 1.20554e-09 -689.236)
(-95.2441 -8695.75 -5.06134e-09 854.1 3.86194e-10 -758.856)
(-207.153 -8978.64 -7.91715e-09 928.131 7.65795e-10 -720.978)
(-206.171 -9259.38 -5.00586e-09 974.357 4.04157e-10 -768.187)
(-225.67 -9528.95 -8.78117e-09 1054.28 8.61405e-10 -828.609)
(-231.371 -9849.47 -4.46744e-09 1113.4 4.78167e-10 -882.027)
(-242.207 -10228.1 -9.40599e-09 1155.45 9.61222e-10 -913.245)
(-227.73 -10630.2 -5.43514e-09 1116.07 4.79645e-10 -888.34)
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
276
(
(-11030.1 4.0298e+06 2.51256e-07 14881.5 -1.81857e-12 -3851.36)
(-22.1604 3.07747e+06 1.45519e-11 48.9827 4.22995e-13 -26.8222)
(-0.558525 4.72604e+06 8.73115e-11 13.6804 -5.38458e-15 -13.1218)
(26.7106 4.98512e+06 8.73115e-11 -51.7444 -4.44089e-16 25.0338)
(33.0507 4.96865e+06 -2.91038e-11 -66.6871 -2.22045e-16 33.6364)
(32.3534 4.90942e+06 2.91038e-11 -65.7228 0 33.3694)
(28.733 4.84322e+06 1.16415e-10 -58.5658 1.77636e-15 29.8328)
(25.8148 4.78132e+06 5.82077e-11 -52.6994 0 26.8845)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(7.06376e-07 1.41376e-07 0 -1.41275e-06 6.38858e-20 7.06376e-07)
(5.0982e-07 4.49564e-07 0 -1.01964e-06 -2.44782e-19 5.0982e-07)
(2.42894e-07 3.64834e-06 8.52343e-11 -5.59439e-07 -2.77728e-19 3.16545e-07)
(2.10219e-07 1.2337e-06 0 -4.20439e-07 -1.61451e-19 2.10219e-07)
(1.90015e-07 2.85127e-07 -6.08525e-11 -3.27387e-07 9.63976e-22 1.37372e-07)
(9.85377e-08 2.32202e-06 0 -1.97075e-07 -6.96081e-19 9.85377e-08)
(7.74908e-08 3.01812e-06 0 -1.54982e-07 -5.0859e-19 7.74908e-08)
(4.83067e-08 4.36475e-06 3.6659e-11 -1.2841e-07 -5.48475e-19 8.01031e-08)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
99
(
(-643.111 8.71233e+06 -4.59238e-09 1264.42 -3.28816e-12 -621.312)
(-502.67 8.69743e+06 -6.63722e-09 940.811 -1.96759e-13 -438.142)
(-501.505 8.58874e+06 3.33976e-09 894.747 -2.33255e-11 -393.242)
(-561.562 8.15262e+06 -1.83191e-08 977.397 -3.09621e-11 -415.836)
(-597.061 7.14536e+06 -6.22538e-09 1036.28 3.08678e-11 -439.216)
(-601.941 5.72953e+06 2.69141e-08 1069.58 3.75191e-11 -467.639)
(-584.378 4.35953e+06 9.05243e-09 1074.43 3.57917e-11 -490.051)
(-556.35 3.26962e+06 1.30254e-08 1062.45 3.42389e-11 -506.105)
...
)
;
    }
}


// ************************************************************************* //
