TestCase/swtblis_2ma/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "600";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
157.435
158.873
155.788
159.717
157.146
153.026
160.664
157.924
...
)
;

boundaryField
{
    top
    {
        type            slip;
    }
    base
    {
        type            fixedValue;
        value           uniform 291;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 108.5;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
