TestCase/swtblis_2ma/0/TuM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      TuM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.00574302
0.00556569
0.0111838
0.00540978
0.0110778
0.0120721
0.0052489
0.0109782
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.00574302
0.00556569
0.00540978
0.0052489
0.00509264
0.00493887
0.00478755
0.00463772
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
4.13554e-11
4.13553e-11
4.13554e-11
4.13553e-11
4.13553e-11
4.13553e-11
4.13553e-11
4.13553e-11
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.00677272;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00319262
0.010177
0.0222798
0.0404672
0.0631195
0.0847901
0.101258
0.112699
...
)
;
    }
}


// ************************************************************************* //
