TestCase/swtblis_2ma/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "600";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
27324
(
(518.45 -0.0801673 0)
(515.758 -0.0788175 0)
(521.958 -0.262597 0)
(514.25 -0.0815167 0)
(519.532 -0.257795 0)
(527.561 -0.49039 0)
(512.506 -0.0867282 0)
(518.147 -0.262482 0)
...
)
;

boundaryField
{
    top
    {
        type            slip;
    }
    base
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (605.5 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
