TestCase/swtblis_2ma/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "600";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1.43407e-05
1.36821e-05
3.63037e-05
1.29432e-05
3.58012e-05
3.8767e-05
1.22447e-05
3.48967e-05
...
)
;

boundaryField
{
    top
    {
        type            slip;
    }
    base
    {
        type            boundaryCorrectedFixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.16662e-10;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
