TestCase/swtblis_2ma/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
251.529
252.674
250.21
253.345
251.298
247.981
254.094
251.919
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
251.529
252.674
253.345
254.094
254.845
255.65
256.488
257.334
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
341.966
341.967
341.966
341.967
341.967
341.966
341.967
341.967
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 208.81;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
341.914
341.67
341.202
340.417
339.241
337.708
335.943
334.059
...
)
;
    }
}


// ************************************************************************* //
