TestCase/swtblis_2ma/0/lambda1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.411677
0.4286
0.543079
0.433081
0.551084
0.561377
0.437947
0.55081
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.411677
0.4286
0.433081
0.437947
0.442344
0.447982
0.454876
0.461715
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.000109068
6.39232e-05
0.00014947
0.000166084
0.000165002
0.000161141
0.000156879
0.000152943
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.55373e-29
9.4083e-30
9.3942e-29
1.18031e-29
1.30784e-30
3.72802e-29
6.26615e-29
1.30818e-28
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.00700419
0.0574539
0.187251
0.341261
0.445202
0.492378
0.508686
0.51329
...
)
;
    }
}


// ************************************************************************* //
