TestCase/swtblis_2ma/0/lambda2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
-0.408457
-0.42566
-0.54245
-0.430407
-0.550515
-0.560853
-0.435142
-0.550326
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-0.408457
-0.42566
-0.430407
-0.435142
-0.439252
-0.444702
-0.451564
-0.458764
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
-0.000109066
-6.39232e-05
-0.00014947
-0.000166084
-0.000165002
-0.000161141
-0.000156879
-0.000152943
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-1.37085e-31
-1.3862e-30
-2.82432e-29
-1.04391e-29
-6.93504e-29
-3.69805e-29
-6.24761e-29
-7.53103e-29
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-0.00700419
-0.0574539
-0.187251
-0.341261
-0.445202
-0.492378
-0.508686
-0.51329
...
)
;
    }
}


// ************************************************************************* //
