TestCase/swtblis_2ma/0/nk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nk;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
7.76316e-06
7.43472e-06
2.87413e-05
7.10284e-06
2.87108e-05
3.21992e-05
6.77215e-06
2.84883e-05
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
7.76316e-06
7.43472e-06
7.10284e-06
6.77215e-06
6.45827e-06
6.16081e-06
5.87585e-06
5.59728e-06
...
)
;
    }
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 5.45506e-06;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0154531
0.0155844
0.0228213
0.0325578
0.0418821
0.0469694
0.0471546
0.0447321
...
)
;
    }
}


// ************************************************************************* //
