TestCase/swtblis_2ma/0/nu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1.09141e-05
1.07707e-05
1.06966e-05
1.06925e-05
1.05479e-05
1.03359e-05
1.0602e-05
1.04643e-05
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
1.09141e-05
1.07707e-05
1.06925e-05
1.0602e-05
1.05114e-05
1.04159e-05
1.03175e-05
1.02164e-05
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
6.8098e-05
6.84819e-05
6.82937e-05
6.81657e-05
6.81587e-05
6.81708e-05
6.81842e-05
6.81981e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.07605e-05;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2.09796e-05
2.09265e-05
2.0825e-05
2.06552e-05
2.04026e-05
2.00765e-05
1.97052e-05
1.93138e-05
...
)
;
    }
}


// ************************************************************************* //
