TestCase/swtblis_2ma/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "600";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1.45473e-05
1.35839e-05
3.64414e-05
1.26958e-05
3.51575e-05
3.82236e-05
1.18452e-05
3.38448e-05
...
)
;

boundaryField
{
    top
    {
        type            slip;
    }
    base
    {
        type            calculated;
        value           uniform 1.66667e-26;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.66667e-10;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
