TestCase/swtblis_2ma/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "600";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
71720.5
72795.7
107439
73976.4
110213
117231
75085
112996
...
)
;

boundaryField
{
    top
    {
        type            slip;
    }
    base
    {
        type            fixedValue;
        value           uniform 6e+09;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 6e+09;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
