TestCase/swtblis_2ma/0/p1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1.4242e-05
1.36603e-05
1.8417e-05
1.31004e-05
1.78605e-05
1.8057e-05
1.25602e-05
1.73067e-05
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
1.4242e-05
1.36603e-05
1.31004e-05
1.25602e-05
1.20424e-05
1.15455e-05
1.10679e-05
1.0607e-05
...
)
;
    }
    base
    {
        type            calculated;
        value           uniform 1.66667e-18;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.66667e-10;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.14967e-10
5.67181e-09
3.03825e-08
1.06823e-07
2.70396e-07
5.29019e-07
8.73267e-07
1.30917e-06
...
)
;
    }
}


// ************************************************************************* //
