TestCase/swtblis_2ma/0/q2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      q2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
3.50171e-17
2.4647e-17
1.71045e-17
1.98498e-17
1.32723e-17
1.19154e-17
1.59862e-17
1.12483e-17
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
3.49476e-17
2.45981e-17
1.98104e-17
1.59545e-17
1.29564e-17
1.04072e-17
8.26563e-18
6.56818e-18
...
)
;
    }
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1
1
1
1
1
1
1
1
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.19792e-14
1.19728e-14
1.25185e-14
1.61673e-14
3.45658e-14
1.33094e-13
6.76361e-13
3.63447e-12
...
)
;
    }
}


// ************************************************************************* //
