TestCase/swtblis_2ma/0/q3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      q3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
2
2
2
2
2
2
2
2
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2
2
2
2
2
2
2
2
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2.93694e-21
2.92048e-21
2.92853e-21
2.93403e-21
2.93433e-21
2.93381e-21
2.93323e-21
2.93263e-21
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 2;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.16444
2
2
2
2
2
2
2
...
)
;
    }
}


// ************************************************************************* //
