TestCase/swtblis_2ma/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "600";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.985795
1.00723
0.996221
1.01949
1.01831
1.01422
1.03373
1.03108
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.985795
1.00723
1.01949
1.03373
1.04823
1.06389
1.08041
1.0976
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.264899
0.263414
0.26414
0.264636
0.264663
0.264616
0.264564
0.26451
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.699972;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.859634
0.860863
0.863224
0.867212
0.873235
0.881183
0.890467
0.900546
...
)
;
    }
}


// ************************************************************************* //
