TestCase/swtblis_2ma/0/wallDistance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallDistance;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
0.15095
0.15095
0.150841
0.15095
0.150841
0.150714
0.15095
0.150841
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
0.151
0.151
0.151
0.151
0.151
0.151
0.151
0.151
...
)
;
    }
    base
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.248108
0.248
0.247872
0.247722
0.247543
0.247332
0.247081
0.246786
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0015825
0.0015825
0.0015825
0.00158251
0.00158251
0.00158252
0.00158254
0.00158256
...
)
;
    }
}


// ************************************************************************* //
