TestCase/swtblis_2ma/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    base
    {
        type            calculated;
        value           nonuniform List<vector> 
276
(
(-145.388 -0.536898 6.56107e-17)
(-111.03 -0.00176721 -1.52609e-17)
(-170.507 -0.000493563 1.94266e-19)
(-179.854 0.00186684 1.60219e-20)
(-179.26 0.00240595 8.01096e-21)
(-177.123 0.00237116 0)
(-174.735 0.00211295 -6.40877e-20)
(-172.501 0.0019013 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
