TestCase/swtblis_2ma/0/xx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      xx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27324
(
1.33289
1.26119
3.40682
1.18735
3.33314
3.69814
1.11727
3.23431
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
1.33289
1.26119
1.18735
1.11727
1.05138
0.989637
0.931441
0.876149
...
)
;
    }
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
276
(
2.44745e-22
2.43373e-22
2.44044e-22
2.44502e-22
2.44527e-22
2.44484e-22
2.44436e-22
2.44386e-22
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.54887e-05;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
1.89466e-05
0.000666405
0.00784235
0.0503771
0.200665
0.533526
1.04393
1.73949
...
)
;
    }
}


// ************************************************************************* //
